import { defineStore } from 'pinia'
export const useCardsStore = defineStore('cardsStore', {
    state: () => ({
        cardInfo: [
            {
                id: 1,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 2,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения2',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `2Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 3,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 4,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 5,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 6,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 7,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 8,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 9,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 10,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 11,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Школа зельеварения',
                subtitle: 'Записывайте великие формулы магистра',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '100',
                rating: '100',
                time: '2-5 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 12,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Скейтер в городе',
                subtitle: 'Осваивайте городские трюки на скейте',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '150',
                rating: '95',
                time: '3-7 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            },
            {
                id: 13,
                img: '/images/cabinet/card/card-img1.png',
                title: 'Пиццерия Луиджи',
                subtitle: 'Лучшие рецепты пиццы от шефа',
                viewIcon: '/images/cabinet/card/views.png',
                ratingIcon: '/images/cabinet/card/rating.png',
                views: '200',
                rating: '98',
                time: '5-10 мин',
                timeIcon: '/public/icons/cabinet/card/time-icon.svg',
                description: `2Пары кореньев, шёпотки соли и котла с кипятком недостаточно для приготовления
                снадобья. Искусство зельеварения требует глубоких знаний о свойствах каждого
                ингредиента, пропорций и правильной последовательностью введения. Выступите
                подмастерьем и составьте точную формулу зелья определяя природу ингредиентов в
                наставлениях изъясняющегося загадками магистра. Орлиное перо или перечный порошок?
                Что сначала? Сколько? Делайте выбор, производите арифметические подсчеты, но будьте
                внимательны – не допускайте взрывов пытаясь поспеть за мастером.  Разминка «Школа
                зельеварения» проверит способность к абстрактному и образному мышлению в
                совокупности со знаниями арифметики, позволяющими подобрать правильный ингредиент и
                пропорции согласно свойствам описанных магистром. `
            }
        ]
    }),

    getters: {
        getCardInfo(state) {
            return state.cardInfo
        }
    },

    actions: {}
})
